# with open("C:/mecab/user-dic/nnp.csv", 'r', encoding='utf-8') as f:
#     file_data = f.readlines()
# print(file_data)

# pip install jamo  ## 종성 여부를 판단하기 위한 라이브러리
#############################
import pandas as pd
from jamo import h2j, j2hcj

def get_jongsung_TF(sample_text):
    sample_text_list = list(sample_text)
    last_word = sample_text_list[-1]
    last_word_jamo_list = list(j2hcj(h2j(last_word)))
    last_jamo = last_word_jamo_list[-1]
    jongsung_TF = "T"
    if last_jamo in ['ㅏ', 'ㅑ', 'ㅓ', 'ㅕ', 'ㅗ', 'ㅛ', 'ㅜ', 'ㅠ', 'ㅡ', 'ㅣ', 'ㅘ', 'ㅚ', 'ㅙ', 'ㅝ', 'ㅞ', 'ㅢ', 'ㅐ,ㅔ', 'ㅟ', 'ㅖ', 'ㅒ']:
        jongsung_TF = "F"
    return jongsung_TF


with open("C:/mecab/user-dic/nnp.csv", 'r', encoding='utf-8') as f:
    file_data = f.readlines()
## 추가할 단어 리스트


myword = pd.read_excel("./data/mywords.xlsx")
# print(myword)
word_list = myword["mywords"].tolist()
# print(word_list)

# word_list = ['각장', '결품', '플라즈마', '히팅기', '히팅토치', '샤클', '레버풀러', '레바풀러', '선탑재', '보강빔', '입고' '이동용', '횡이송', '버티칼',
#              '론지', '이동', '가열', '파렛팅','파레팅', '팔레트', '촌법', '곡외판', '곡형강', '형강', '반출', '백히팅', '결품', '권상', '팔렛트',
#              '불량부', '턴오버', '탑재', '판계', '후레시', '워셔', '스트레이너', "유볼트", '정리정돈', '재현기', '교반기', '공기구', '백가우징', '가우징',
#              '마그네트', '손수레', '척조오', '이송', '길이', '스페너', '스패너', '유니버셜', '옵셋', '공냉', '구동부','곤돌라', '곤도라', '고임목',
#              '크리닝', '블라스팅', '건도막', '신너', '신나', '내부재', '내업', '외업', '철의장품', '블라스팅', '믹싱', "미끌", '에어', '밀폐공간',
#              '고소작업차', '고소차', '시져스', '재조정', '스크류', '가견투', '텔레스코핑', '블로잉', '에어리스', '개구부', '맨홀', '래싱', '사운딩',
#              '집크레인', '엔진룸', '절차서', '입회', '가압', '설계부', '베터리', '커미셔닝', '미점검', '로드뱅크', '벨브', '갱웨이',
#              '가스선', '인터락', '구리스', '라이싱', '솔벤트', '용접복', '아웃트리거', '주수량', '주의사항', '송급', '골재부',
#              '동담금', '백킹재', '단책', '얼라인', '브라켓', '폴리싱', '인계품', '동파이프', '찬넬', '젠다이', '건조', '유압잭',
#              '에어컴프레셔', '플렌지', '볼팅','볼트', '그라인드', '그라인딩', '밴딩', '바인드', '멀티코어', '융착', '드레인', '입고', "충진", '판계판',
#              '소조판', '소부재', '압조절', '와이어링', '컴파운드', '직송재', '주유차','유류차', '부재', 'CO2', '리무버',
#              '브러쉬', '라쳇트', '플레이블', '밴딩기', '핸드레일', '컴프레셔', '오일챔버', '개선면', '파워램', '러빙', '선미',
#              'PE장', '웰딩', '배수', '관통관', '작동유', '아이샤워', '보온핀', '보온', '절곡기', '블로윙', 'N2', '텐셔너', '피킹',
#              '스텐션', '동시간대', '아답타링', '플래지', '방청유', '세척', '입회', '스넵링', '가네트', '분배기', '셋업', '빠루',
#              '공사지원부', '동기화', '오통전', '취외', '전장품', '길이', '밸트', '팬스', '소둔선', '안전밸트','안전펜스','출고',
#              '텐션', '인양', '캐비넷', '켈리퍼스', '돌리개', '헬맷', '라틸', '손망치', '자키램', '셋타', '에어호스', '화물표',
#              '입고품', '몰드라인', '판계장', '권양물', '권양', '배열', '소조품', '판받이', '수마킹', '불량부', '팔렛트', '협소', '가서포트',
#              '주차', '세이브올', '세이브올셋터', '체인블록', '유기용제', '임팩트', '세움', '절단품', '손수레', '모따기', '반기', '셀가이드',
#              '표식물', '생산팀장', '에어윈치', '그레이팅', '세퍼레이터', '스펙타클', '팁가드', '잉여재', '하프드럼', '도료캔', '위보기',
#              '분산판', '스터드', '커넥터', '컨넥터', '소모듈', '메인엔진', '설치품', '서비스타워', '로벡스', '무어링','무링', '블러스터',
#              '터그보트','터그', '콤프레샤', '콤프레서','콤프레셔', '숫지그', '암지그', '안전시설물', '공작도', '이동', '주행', '삼타점', '3타점', '컷트기', '이동금지',
#              '달줄', '당김줄', '전용통로', '로테이터', '포지셔너', '버니어캘러퍼스', '버니어캘리퍼스', '네임테그', '스케쥴', '겐츄리', '겐트리',
#              '발끝막이판', '운송장비', '치공구', '붐대', '와인더', '리미트', '롤리프', '가배관', '계측관', '구동부', '상/하', '백레스트',
#              '후진벨', '강재판', '도크장', '유의사항', '헤자클레스', '탑재용', '도크', '홀커버', '커버', '체인슬링', '소조립', '가이드피스',
#              '귀마개', '스텝', '스탭', '크롤러', '하이드로', '바이패스', '블록리프터', '셀타', '송기마스크', '송기', '방독마스크',
#              '수중절단', '수중클리닝', '스토퍼', '스트링기어', '스트링', '스턴튜브', '스프레이건', '스프레이캔', '스프레이', '에어테스트', '앵커체인',
#              '에어자켓', '에어퍼지', '엘리베이터', '온도시험', '용접피더', '유니버셜', '자바라', '워킹플랫폼', '작업대', '작업차량', '커팅', '컷팅',
#              '잭업', '자키', '카크레인', '컨베이어', '대차', '터치업', '턴버클', '테이프', '트랜스포터', '트러스', '트레일러', '플러슁', '플러싱',
#              '함석판', '해머', '해치커버', '해치', '화기작업', '환기팬', '팬모터', '라이프보트', '라싱브릿지', '라싱파이프', '라싱',
#              '와이어로프', '슬링밸트', '슬링벨트', '섬유슬링', '클램프', '유니트', '아르곤', '티그', '유볼트', '퓨리파이어', '패시베이션']

#
for word in word_list:
    jongsung_TF = get_jongsung_TF(word)
    line = '{},,,,NNP,*,{},{},*,*,*,*,*\n'.format(word, jongsung_TF, word)

    file_data.append(line)


##
with open("C:/mecab/user-dic/nnp.csv", 'w', encoding='utf-8') as f:
    for line in file_data:
        f.write(line)

###
with open("C:/mecab/user-dic/nnp.csv", 'r', encoding='utf-8') as f:
    file_new = f.readlines()

print(file_new)





